---

C#Visual BasicVisual C++

Revit 2024 API
---
FamilyType..::..AsInteger Method
FamilyType Class See Also Send Feedback
---

Provides access to the integer number of the given family parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public Nullable<int> AsInteger(
    	FamilyParameter familyParameter
    )

Visual Basic
---

    Public Function AsInteger ( _
    	familyParameter As FamilyParameter _
    ) As Nullable(Of Integer)

Visual C++
---

    public:
    Nullable<int> AsInteger(
    	FamilyParameter^ familyParameter
    )

#### Parameters

familyParameter
    Type: Autodesk.Revit.DB..::..FamilyParameter

#### Return Value

The integer value contained in the parameter. Returns nullNothingnullptra null reference (Nothing in Visual Basic) if the storage type of the input argument is not integer type or this parameter has no value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input argument-"familyParameter"-is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the input argument-"familyParameter"-is invalid, |

# See Also

FamilyType Class

Autodesk.Revit.DB Namespace